tap "facebook/fb"
tap "go-task/tap"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "ynqa/tap"
tap "xcodesorg/made"
brew "actionlint"
brew "pycparser"
brew "cffi"
brew "cryptography"
brew "ansible"
brew "awscli"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "autoconf"
brew "bat"
brew "glib"
brew "chisel"
brew "circleci"
brew "coreutils"
brew "curl"
brew "diff-so-fancy"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gcc"
brew "gh"
brew "harfbuzz"
brew "openjpeg"
brew "ghostscript"
brew "ghq"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "openjdk"
brew "gradle"
brew "hexyl"
brew "htop"
brew "httpie"
brew "hyperfine"
brew "idb-companion"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "jenv"
brew "jq"
brew "kdoctor"
brew "mas"
brew "mint"
brew "nghttp2"
brew "node"
brew "protobuf"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "quicktype"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "sheldon"
brew "starship"
brew "tree"
brew "wabt"
brew "wget"
brew "xcodes"
brew "xcode-kotlin"
brew "xh"
brew "zlib"
brew "go-task/tap/go-task"
brew "ynqa/tap/jnv"
brew "uv"
cask "chatgpt"
cask "charles"
cask "cursor"
cask "docker"
cask "ghostty"
cask "hammerspoon"
cask "notion"
cask "notion-calendar"
cask "obsidian"
cask "raycast"
cask "stats"
cask "warp"
cask "windsurf"
cask "github-copilot-for-xcode"
cask "obsidian"
mas "GarageBand", id: 682658836
mas "GIPHY CAPTURE", id: 668208984
mas "Keynote", id: 409183694
mas "Kindle Classic", id: 405399194
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Playgrounds", id: 1496833156
mas "Slack", id: 803453959
mas "TestFlight", id: 899247664

# browsers

cask "arc"
cask "brave-browser"
cask "google-chrome"
cask "firefox"
cask "zen"

# dotfiles

brew "chezmoi"

